// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.


let num = 0;

while (num < 10) {
  console.log("Number: ", num);
  num += 1;
}


// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue.


const number = 10;

for (let i = 0; i < number; i += 1) {
  if (i % 2 === 1) {
    continue;
  }

  console.log("Парне i: ", i);
}

// Вивести на екран таблицю множення числа 7 за допомогою циклу for.


for (let i = 1; i <= 10; i += 1) {
    console.log(`7 x ${i} = ${7 * i}`);
}


// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

let num2 = 1;
const numMax = 5;

while (num2 < numMax) {
  console.log(num2);
  num2 += 1;
}


// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.


let maxsum = 10;


for (let i = 0; i <= maxsum; i += 1) {
    console.log(i);
  
    if (i === 7) {
      console.log("Знайшли число 7, перериваємо виконання циклу");
      break;
    }
  }
  

// Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

let total = 9;


for (let i = 0; i <= total; i += 1) {
    console.log(i);
  
    if (i === 9) {
      console.log("Цикл закінчений!");
      break;
    }
  }



// За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue. 


const arraysThree = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20];
for (const arrayThree of arraysThree) {
    if (arrayThree === 3) {
        console.log('Кратне 3');
        continue;
    }
    console.log('Не кратне 3 :>> ',arrayThree);
}